### series data frames,continuation

In [1]:
import pandas as pd

In [2]:
original_sports=pd.Series({'Archery':'Bhutan',
                           'Golf': 'Scotland',
                           'Sumo':'Japan',
                            'Taekwondo':'South Korea'})
cricket_loving_countries=pd.Series(['Australia',
                                    'Barbados',
                                    'Pakistan',
                                   'England'],
                                  index=['cricket',
                                         'cricket',
                                         'cricket',
                                         'cricket'])
all_countries=original_sports.append(cricket_loving_countries)

In [3]:
original_sports

Archery           Bhutan
Golf            Scotland
Sumo               Japan
Taekwondo    South Korea
dtype: object

In [4]:
cricket_loving_countries

cricket    Australia
cricket     Barbados
cricket     Pakistan
cricket      England
dtype: object

In [5]:
all_countries

Archery           Bhutan
Golf            Scotland
Sumo               Japan
Taekwondo    South Korea
cricket        Australia
cricket         Barbados
cricket         Pakistan
cricket          England
dtype: object

In [6]:
all_countries.loc['cricket']

cricket    Australia
cricket     Barbados
cricket     Pakistan
cricket      England
dtype: object

In [7]:
all_countries.loc['Archery']

'Bhutan'

In [8]:
type(all_countries.loc['cricket'])

pandas.core.series.Series

In [9]:
all_countries.loc['cricket'].iloc[0]

'Australia'

In [10]:
a=all_countries['cricket']

In [11]:
a.iloc[0]='australia'

In [12]:
a

cricket    australia
cricket     Barbados
cricket     Pakistan
cricket      England
dtype: object

In [13]:
all_countries[4]='Australia'

In [14]:
all_countries

Archery           Bhutan
Golf            Scotland
Sumo               Japan
Taekwondo    South Korea
cricket        Australia
cricket         Barbados
cricket         Pakistan
cricket          England
dtype: object

### The DataFrame Data structure

In [15]:
purchase_1=pd.Series({'Name':'siri',
                     'Item Purchased':'oreo',
                     'Cost':30})
purchase_2=pd.Series({'Name':'usha',
                     'Item Purchased':'choclates',
                     'Cost':10})
purchase_3=pd.Series({'Name':'vyshu',
                     'Item Purchased':'panipuri',
                     'Cost':15})
df=pd.DataFrame(
    [purchase_1,purchase_2,purchase_3],
    index=['store 1','store 2','store 1'])
df.head()

          Name Item Purchased  Cost
store 1   siri           oreo    30
store 2   usha      choclates    10
store 1  vyshu       panipuri    15

In [16]:
df.loc['store 2']

Name                   usha
Item Purchased    choclates
Cost                     10
Name: store 2, dtype: object

In [17]:
type(df.loc['store 2'])

pandas.core.series.Series

In [18]:
type(df.loc['store 1'])

pandas.core.frame.DataFrame

In [19]:
df.loc['store 2','Cost']

10

In [20]:
df.loc['store 1','Cost'] ### index,columns

store 1    30
store 1    15
Name: Cost, dtype: int64

In [21]:
df.T

               store 1    store 2   store 1
Name              siri       usha     vyshu
Item Purchased    oreo  choclates  panipuri
Cost                30         10        15

In [22]:
df

          Name Item Purchased  Cost
store 1   siri           oreo    30
store 2   usha      choclates    10
store 1  vyshu       panipuri    15

In [23]:
type(df.T)

pandas.core.frame.DataFrame

In [24]:
df.T.loc['Cost']

store 1    30
store 2    10
store 1    15
Name: Cost, dtype: object

In [25]:
df.T.loc['Item Purchased']

store 1         oreo
store 2    choclates
store 1     panipuri
Name: Item Purchased, dtype: object

In [26]:
df['Item Purchased']

store 1         oreo
store 2    choclates
store 1     panipuri
Name: Item Purchased, dtype: object

In [27]:
df.loc['store 1']

          Name Item Purchased  Cost
store 1   siri           oreo    30
store 1  vyshu       panipuri    15

In [28]:
df.loc['store 1']['Cost']

store 1    30
store 1    15
Name: Cost, dtype: int64

In [29]:
df.loc[:,['Name','Cost']]

          Name  Cost
store 1   siri    30
store 2   usha    10
store 1  vyshu    15

In [30]:
df.drop('store 2')

          Name Item Purchased  Cost
store 1   siri           oreo    30
store 1  vyshu       panipuri    15

In [31]:
df

          Name Item Purchased  Cost
store 1   siri           oreo    30
store 2   usha      choclates    10
store 1  vyshu       panipuri    15

In [32]:
copy_df=df.copy()
copy_df=copy_df.drop('store 2')
copy_df

          Name Item Purchased  Cost
store 1   siri           oreo    30
store 1  vyshu       panipuri    15

In [33]:
copy_df=df.copy()
copy_df.drop('store 2')
copy_df

          Name Item Purchased  Cost
store 1   siri           oreo    30
store 2   usha      choclates    10
store 1  vyshu       panipuri    15

In [34]:
df

          Name Item Purchased  Cost
store 1   siri           oreo    30
store 2   usha      choclates    10
store 1  vyshu       panipuri    15

In [35]:
copy_df=df.copy()
copy_df.drop('store 2',inplace=True)
copy_df

          Name Item Purchased  Cost
store 1   siri           oreo    30
store 1  vyshu       panipuri    15

In [36]:
del copy_df['Name']

In [37]:
copy_df

        Item Purchased  Cost
store 1           oreo    30
store 1       panipuri    15

In [38]:
df['Location']=None

In [39]:
df

          Name Item Purchased  Cost Location
store 1   siri           oreo    30     None
store 2   usha      choclates    10     None
store 1  vyshu       panipuri    15     None

In [40]:
df['Location']=['bvrm','nsp','pkl']

In [41]:
df

          Name Item Purchased  Cost Location
store 1   siri           oreo    30     bvrm
store 2   usha      choclates    10      nsp
store 1  vyshu       panipuri    15      pkl

In [42]:
df['Location']

store 1    bvrm
store 2     nsp
store 1     pkl
Name: Location, dtype: object

In [43]:
df

          Name Item Purchased  Cost Location
store 1   siri           oreo    30     bvrm
store 2   usha      choclates    10      nsp
store 1  vyshu       panipuri    15      pkl

In [44]:
df.loc['store 2','Location']='mumbai'

In [45]:
df

          Name Item Purchased  Cost Location
store 1   siri           oreo    30     bvrm
store 2   usha      choclates    10   mumbai
store 1  vyshu       panipuri    15      pkl

### Dataframe indexing and Loading

In [46]:
costs=df['Cost']

In [47]:
costs

store 1    30
store 2    10
store 1    15
Name: Cost, dtype: int64

In [48]:
costs+=2

In [49]:
costs

store 1    32
store 2    12
store 1    17
Name: Cost, dtype: int64

In [50]:
df=pd.read_csv('olympics.csv')
df.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15
0,NaN,№ Summer,01 !,02 !,03 !,Total,№ Winter,01 !,02 !,03 !,Total,№ Games,01 !,02 !,03 !,Combined total
1,Afghanistan (AFG),13,0,0,2,2,0,0,0,0,0,13,0,0,2,2
2,Algeria (ALG),12,5,2,8,15,3,0,0,0,0,15,5,2,8,15
3,Argentina (ARG),23,18,24,28,70,18,0,0,0,0,41,18,24,28,70
4,Armenia (ARM),5,1,2,9,12,6,0,0,0,0,11,1,2,9,12

In [51]:
df = pd.read_csv('olympics.csv', index_col=0, skiprows=1)

In [52]:
df.head()

,№ Summer,01 !,02 !,03 !,Total,№ Winter,01 !.1,02 !.1,03 !.1,Total.1,№ Games,01 !.2,02 !.2,03 !.2,Combined total
Afghanistan (AFG),13,0,0,2,2,0,0,0,0,0,13,0,0,2,2
Algeria (ALG),12,5,2,8,15,3,0,0,0,0,15,5,2,8,15
Argentina (ARG),23,18,24,28,70,18,0,0,0,0,41,18,24,28,70
Armenia (ARM),5,1,2,9,12,6,0,0,0,0,11,1,2,9,12
Australasia (ANZ) [ANZ],2,3,4,5,12,0,0,0,0,0,2,3,4,5,12

In [53]:
for col in df.columns:
    if col[:2]=='01':
        df.rename(columns={col:'Gold'+col[4:]}, inplace=True)
    if col[:2]=='02':
        df.rename(columns={col:'Silver'+col[4:]}, inplace=True)
    if col[:2]=='03':
        df.rename(columns={col:'Bronze'+col[4:]}, inplace=True)
    if col[:1]=='№':
        df.rename(columns={col:'#'+col[1:]}, inplace=True)

In [54]:
df.head()

,# Summer,Gold,Silver,Bronze,Total,# Winter,Gold.1,Silver.1,Bronze.1,Total.1,# Games,Gold.2,Silver.2,Bronze.2,Combined total
Afghanistan (AFG),13,0,0,2,2,0,0,0,0,0,13,0,0,2,2
Algeria (ALG),12,5,2,8,15,3,0,0,0,0,15,5,2,8,15
Argentina (ARG),23,18,24,28,70,18,0,0,0,0,41,18,24,28,70
Armenia (ARM),5,1,2,9,12,6,0,0,0,0,11,1,2,9,12
Australasia (ANZ) [ANZ],2,3,4,5,12,0,0,0,0,0,2,3,4,5,12

In [55]:
df.columns

Index(['# Summer', 'Gold', 'Silver', 'Bronze', 'Total', '# Winter', 'Gold.1',
       'Silver.1', 'Bronze.1', 'Total.1', '# Games', 'Gold.2', 'Silver.2',
       'Bronze.2', 'Combined total'],
      dtype='object')

In [56]:
df.values

array([[   13,     0,     0, ...,     0,     2,     2],
       [   12,     5,     2, ...,     2,     8,    15],
       [   23,    18,    24, ...,    24,    28,    70],
       ...,
       [   12,     3,     4, ...,     4,     1,     8],
       [    3,     8,     5, ...,     5,     4,    17],
       [   27,  4809,  4775, ...,  5733,  6078, 17579]], dtype=int64)

In [57]:
df['Gold']

Afghanistan (AFG)                                  0
Algeria (ALG)                                      5
Argentina (ARG)                                   18
Armenia (ARM)                                      1
Australasia (ANZ) [ANZ]                            3
Australia (AUS) [AUS] [Z]                        139
Austria (AUT)                                     18
Azerbaijan (AZE)                                   6
Bahamas (BAH)                                      5
Bahrain (BRN)                                      0
Barbados (BAR) [BAR]                               0
Belarus (BLR)                                     12
Belgium (BEL)                                     37
Bermuda (BER)                                      0
Bohemia (BOH) [BOH] [Z]                            0
Botswana (BOT)                                     0
Brazil (BRA)                                      23
British West Indies (BWI) [BWI]                    0
Bulgaria (BUL) [H]                                51
Burundi (BDI)                                      1
Cameroon (CMR)                                     3
Canada (CAN)                                      59
Chile (CHI) [I]                                    2
China (CHN) [CHN]                                201
Colombia (COL)                                     2
Costa Rica (CRC)                                   1
Ivory Coast (CIV) [CIV]                            0
Croatia (CRO)                                      6
Cuba (CUB) [Z]                                    72
Cyprus (CYP)                                       0
                                                ...
Sri Lanka (SRI) [SRI]                              0
Sudan (SUD)                                        0
Suriname (SUR) [E]                                 1
Sweden (SWE) [Z]                                 143
Switzerland (SUI)                                 47
Syria (SYR)                                        1
Chinese Taipei (TPE) [TPE] [TPE2]                  2
Tajikistan (TJK)                                   0
Tanzania (TAN) [TAN]                               0
Thailand (THA)                                     7
Togo (TOG)                                         0
Tonga (TGA)                                        0
Trinidad and Tobago (TRI) [TRI]                    2
Tunisia (TUN)                                      3
Turkey (TUR)                                      39
Uganda (UGA)                                       2
Ukraine (UKR)                                     33
United Arab Emirates (UAE)                         1
United States (USA) [P] [Q] [R] [Z]              976
Uruguay (URU)                                      2
Uzbekistan (UZB)                                   5
Venezuela (VEN)                                    2
Vietnam (VIE)                                      0
Virgin Islands (ISV)                               0
Yugoslavia (YUG) [YUG]                            26
Independent Olympic Participants (IOP) [IOP]       0
Zambia (ZAM) [ZAM]                                 0
Zimbabwe (ZIM) [ZIM]                               3
Mixed team (ZZX) [ZZX]                             8
Totals                                          4809
Name: Gold, Length: 147, dtype: int64

In [58]:
df['Gold']>=5

Afghanistan (AFG)                               False
Algeria (ALG)                                    True
Argentina (ARG)                                  True
Armenia (ARM)                                   False
Australasia (ANZ) [ANZ]                         False
Australia (AUS) [AUS] [Z]                        True
Austria (AUT)                                    True
Azerbaijan (AZE)                                 True
Bahamas (BAH)                                    True
Bahrain (BRN)                                   False
Barbados (BAR) [BAR]                            False
Belarus (BLR)                                    True
Belgium (BEL)                                    True
Bermuda (BER)                                   False
Bohemia (BOH) [BOH] [Z]                         False
Botswana (BOT)                                  False
Brazil (BRA)                                     True
British West Indies (BWI) [BWI]                 False
Bulgaria (BUL) [H]                               True
Burundi (BDI)                                   False
Cameroon (CMR)                                  False
Canada (CAN)                                     True
Chile (CHI) [I]                                 False
China (CHN) [CHN]                                True
Colombia (COL)                                  False
Costa Rica (CRC)                                False
Ivory Coast (CIV) [CIV]                         False
Croatia (CRO)                                    True
Cuba (CUB) [Z]                                   True
Cyprus (CYP)                                    False
                                                ...
Sri Lanka (SRI) [SRI]                           False
Sudan (SUD)                                     False
Suriname (SUR) [E]                              False
Sweden (SWE) [Z]                                 True
Switzerland (SUI)                                True
Syria (SYR)                                     False
Chinese Taipei (TPE) [TPE] [TPE2]               False
Tajikistan (TJK)                                False
Tanzania (TAN) [TAN]                            False
Thailand (THA)                                   True
Togo (TOG)                                      False
Tonga (TGA)                                     False
Trinidad and Tobago (TRI) [TRI]                 False
Tunisia (TUN)                                   False
Turkey (TUR)                                     True
Uganda (UGA)                                    False
Ukraine (UKR)                                    True
United Arab Emirates (UAE)                      False
United States (USA) [P] [Q] [R] [Z]              True
Uruguay (URU)                                   False
Uzbekistan (UZB)                                 True
Venezuela (VEN)                                 False
Vietnam (VIE)                                   False
Virgin Islands (ISV)                            False
Yugoslavia (YUG) [YUG]                           True
Independent Olympic Participants (IOP) [IOP]    False
Zambia (ZAM) [ZAM]                              False
Zimbabwe (ZIM) [ZIM]                            False
Mixed team (ZZX) [ZZX]                           True
Totals                                           True
Name: Gold, Length: 147, dtype: bool

In [59]:
df['Gold']>0

Afghanistan (AFG)                               False
Algeria (ALG)                                    True
Argentina (ARG)                                  True
Armenia (ARM)                                    True
Australasia (ANZ) [ANZ]                          True
Australia (AUS) [AUS] [Z]                        True
Austria (AUT)                                    True
Azerbaijan (AZE)                                 True
Bahamas (BAH)                                    True
Bahrain (BRN)                                   False
Barbados (BAR) [BAR]                            False
Belarus (BLR)                                    True
Belgium (BEL)                                    True
Bermuda (BER)                                   False
Bohemia (BOH) [BOH] [Z]                         False
Botswana (BOT)                                  False
Brazil (BRA)                                     True
British West Indies (BWI) [BWI]                 False
Bulgaria (BUL) [H]                               True
Burundi (BDI)                                    True
Cameroon (CMR)                                   True
Canada (CAN)                                     True
Chile (CHI) [I]                                  True
China (CHN) [CHN]                                True
Colombia (COL)                                   True
Costa Rica (CRC)                                 True
Ivory Coast (CIV) [CIV]                         False
Croatia (CRO)                                    True
Cuba (CUB) [Z]                                   True
Cyprus (CYP)                                    False
                                                ...
Sri Lanka (SRI) [SRI]                           False
Sudan (SUD)                                     False
Suriname (SUR) [E]                               True
Sweden (SWE) [Z]                                 True
Switzerland (SUI)                                True
Syria (SYR)                                      True
Chinese Taipei (TPE) [TPE] [TPE2]                True
Tajikistan (TJK)                                False
Tanzania (TAN) [TAN]                            False
Thailand (THA)                                   True
Togo (TOG)                                      False
Tonga (TGA)                                     False
Trinidad and Tobago (TRI) [TRI]                  True
Tunisia (TUN)                                    True
Turkey (TUR)                                     True
Uganda (UGA)                                     True
Ukraine (UKR)                                    True
United Arab Emirates (UAE)                       True
United States (USA) [P] [Q] [R] [Z]              True
Uruguay (URU)                                    True
Uzbekistan (UZB)                                 True
Venezuela (VEN)                                  True
Vietnam (VIE)                                   False
Virgin Islands (ISV)                            False
Yugoslavia (YUG) [YUG]                           True
Independent Olympic Participants (IOP) [IOP]    False
Zambia (ZAM) [ZAM]                              False
Zimbabwe (ZIM) [ZIM]                             True
Mixed team (ZZX) [ZZX]                           True
Totals                                           True
Name: Gold, Length: 147, dtype: bool

In [60]:
df['Gold.2']>=1

Afghanistan (AFG)                               False
Algeria (ALG)                                    True
Argentina (ARG)                                  True
Armenia (ARM)                                    True
Australasia (ANZ) [ANZ]                          True
Australia (AUS) [AUS] [Z]                        True
Austria (AUT)                                    True
Azerbaijan (AZE)                                 True
Bahamas (BAH)                                    True
Bahrain (BRN)                                   False
Barbados (BAR) [BAR]                            False
Belarus (BLR)                                    True
Belgium (BEL)                                    True
Bermuda (BER)                                   False
Bohemia (BOH) [BOH] [Z]                         False
Botswana (BOT)                                  False
Brazil (BRA)                                     True
British West Indies (BWI) [BWI]                 False
Bulgaria (BUL) [H]                               True
Burundi (BDI)                                    True
Cameroon (CMR)                                   True
Canada (CAN)                                     True
Chile (CHI) [I]                                  True
China (CHN) [CHN]                                True
Colombia (COL)                                   True
Costa Rica (CRC)                                 True
Ivory Coast (CIV) [CIV]                         False
Croatia (CRO)                                    True
Cuba (CUB) [Z]                                   True
Cyprus (CYP)                                    False
                                                ...
Sri Lanka (SRI) [SRI]                           False
Sudan (SUD)                                     False
Suriname (SUR) [E]                               True
Sweden (SWE) [Z]                                 True
Switzerland (SUI)                                True
Syria (SYR)                                      True
Chinese Taipei (TPE) [TPE] [TPE2]                True
Tajikistan (TJK)                                False
Tanzania (TAN) [TAN]                            False
Thailand (THA)                                   True
Togo (TOG)                                      False
Tonga (TGA)                                     False
Trinidad and Tobago (TRI) [TRI]                  True
Tunisia (TUN)                                    True
Turkey (TUR)                                     True
Uganda (UGA)                                     True
Ukraine (UKR)                                    True
United Arab Emirates (UAE)                       True
United States (USA) [P] [Q] [R] [Z]              True
Uruguay (URU)                                    True
Uzbekistan (UZB)                                 True
Venezuela (VEN)                                  True
Vietnam (VIE)                                   False
Virgin Islands (ISV)                            False
Yugoslavia (YUG) [YUG]                           True
Independent Olympic Participants (IOP) [IOP]    False
Zambia (ZAM) [ZAM]                              False
Zimbabwe (ZIM) [ZIM]                             True
Mixed team (ZZX) [ZZX]                           True
Totals                                           True
Name: Gold.2, Length: 147, dtype: bool

In [61]:
only_gold=df.where((df['Gold']>0)
only_gold.head()

SyntaxError: invalid syntax (<ipython-input-61-e4e01cd4bde0>, line 2)

In [ ]:
only_gold['Gold'].count()

In [ ]:
only_gold=only_gold.dropna()
only_gold.head()

In [ ]:
df.head()

In [ ]:
only_gold=df[df['Gold']>0]
only_gold.head()

In [ ]:
only_gold=df.where(df['Silver.2']>=1)
only_gold.head()

In [ ]:
df

In [ ]:
df['Silver.2']>=1

In [ ]:
df[df['Silver.2']>=1]['Silver.2'].count()

In [ ]:
df

In [ ]:
len(df[(df['Gold']>0)|(df['Gold.1']>0)])

In [ ]:
len(df[(df['Gold']>0)&(df['Gold.1']>0)])

In [ ]:
df['country']=df.index
df.set_index('Gold').head()

In [ ]:
df=df.reset_index()
df.head()

In [ ]:
df=pd.read_csv('census.csv')
df.head()

In [ ]:
df['SUMLEV'].unique()

In [ ]:
df=df[df['SUMLEV']==50]
df.head()

In [ ]:
df[['SUMLEV','STATE','COUNTY']]

In [ ]:
df.head()

In [ ]:
df=df.set_index(['STNAME','CTYNAME'])

In [ ]:
df.loc['Alabama','Autauga County']

In [ ]:
df.loc[[('Michigan','Washtenaw County'),
       ('Michigan','Wayne County')]]

### MISSING VALUES

In [ ]:
df=pd.read_csv('log.csv')
df.head()

In [ ]:
df.fillna?

In [ ]:
df=df.set_index('time')
df.head()

In [ ]:
df=df.sort_index()
df.head()

In [ ]:
df=df.reset_index()
df.head()

In [ ]:
df=df.set_index(['time','user'])
df

In [ ]:
df.head()

In [ ]:
df.fillna('hi').head()

In [ ]:
df.fillna(method='ffill').head()

In [ ]:
df

In [ ]:
df.fillna(method='bfill')

In [ ]:
a=(1,2,3,44,55,5,556,66)

In [ ]:
a

In [ ]:
a.index(1)